# Пошук за CSS-селекторами

import requests
from bs4 import BeautifulSoup

url = "http://quotes.toscrape.com/"
page = requests.get(url)
soup = BeautifulSoup(page.text, "html.parser")

# Прості селектори ######################
# - шукають елементи за ім'ям тегу, класом або ідентифікатором, за допомогою методу select. 
# Метод select дозволяє шукати елементи на основі CSS-селекторів. 
# Він приймає рядок із CSS-селектором і повертає всі елементи, що відповідають цьому селектору.
# Знайдемо всі теги <p> на сторінці
print("-------------------------------")
p = soup.select("p")
print(p)
# Знайдемо всі елементи з класом "text"
print("-------------------------------")
text = soup.select(".text")
print(text)
# Знайдемо всі елементи з ідентифікатором "header". 
# Ідентифікатор - це спеціальний атрибут тегу id.
print("-------------------------------")
header = soup.select("#header")
print(header)


# Комбіновані селектори ##################
# - шукають елементи, що відповідають кільком умовам.
# знайдемо всі елементи <a> всередині тегу <div> з класом "container":
print("-------------------------------")
a = soup.select("div.container a")
print(a)


# Атрибути ###############################
# Можна шукати елементи за значенням атрибутів. 
# Знайдемо всі елементи, у яких атрибут href починається з "https://"
print("-------------------------------")
href = soup.select("[href^='https://']")
print(href)
# Знайдемо всі елементи, у яких атрибут class містить слово "text"
print("-------------------------------")
ctext = soup.select("[class*='text']")
print(ctext)


